In [20]:
import pandas as pd

portion_data1 = {'order_id': [2, 1, 3], 'item_name': ['Burger', 'Pizza', 'Salad'], 'quanity': [2,1,3] }
orders_df = pd.DataFrame(portion_data1)

portion_data2 = {'order_id': [2, 1, 3], 'item_name': ['Soup', 'Burger', 'Wok'], 'quanity': [1,3,4] }
portions_df = pd.DataFrame(portion_data2)

orders_df
portions_df

   order_id item_name  quanity
0         2      Soup        1
1         1    Burger        3
2         3       Wok        4

In [27]:
df1 = pd.concat([orders_df, portions_df], axis=1)
df1

   order_id customer_name  total_amount  order_id item_name  total_amount
0         1         Alice         25.50         2    Burger         25.50
1         2           Bob         30.20         1     Pizza         30.20
2         3       Charlie         15.75         3     Salad         15.75

In [50]:
orders_data = {'order_id': [1,2,3], 'customer_name': ['Alice', 'Bob', 'Charlie'], 'total_amount': [25.5, 30.2, 15.75]}
orders_df = pd.DataFrame(orders_data)

portion_data = {'order_id': [2,1,3], 'item_name': ['Burger', 'Pizza', 'Salad'], 'total_amount': [25.5, 30.2, 15.75]}
portions_df = pd.DataFrame(portion_data)

In [51]:
orders_df

   order_id customer_name  total_amount
0         1         Alice         25.50
1         2           Bob         30.20
2         3       Charlie         15.75

In [49]:
portions_df

   order_id item_name  total_amount
0         2    Burger         25.50
1         1     Pizza         30.20
2         3     Salad         15.75

In [72]:
results = pd.merge(orders_df, portions_df, on='order_id')
results

   order_id customer_name  total_amount_x item_name  total_amount_y
0         1         Alice           25.50     Pizza           30.20
1         2           Bob           30.20    Burger           25.50
2         3       Charlie           15.75     Salad           15.75